sth007/DubaiCity/.pio-core/platforms/espressif32/examples/espidf-arduino-matter-light/sdkconfig.defaults.thread
CONFIG_IDF_TARGET="esp32c6"

# Arduino Settings
CONFIG_FREERTOS_HZ=1000
CONFIG_AUTOSTART_ARDUINO=y

# Log Levels
# Boot Messages - Log level
CONFIG_BOOTLOADER_LOG_LEVEL_ERROR=y
# Arduino Log Level
CONFIG_ARDUHAL_LOG_DEFAULT_LEVEL_INFO=y
# IDF Log Level
CONFIG_LOG_DEFAULT_LEVEL_ERROR=y

# Default to 921600 baud when flashing and monitoring device
CONFIG_ESPTOOLPY_BAUD_921600B=y
CONFIG_ESPTOOLPY_BAUD=921600
CONFIG_ESPTOOLPY_COMPRESSED=y
CONFIG_ESPTOOLPY_MONITOR_BAUD_115200B=y
CONFIG_ESPTOOLPY_MONITOR_BAUD=115200
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y

# libsodium
CONFIG_LIBSODIUM_USE_MBEDTLS_SHA=y

# NIMBLE
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
# CONFIG_BT_NIMBLE_EXT_ADV is not set
CONFIG_BT_NIMBLE_HCI_EVT_BUF_SIZE=70
# CONFIG_USE_BLE_ONLY_FOR_COMMISSIONING is not set

# FreeRTOS should use legacy API
CONFIG_FREERTOS_ENABLE_BACKWARD_COMPATIBILITY=y

# Enable OpenThread
CONFIG_OPENTHREAD_ENABLED=y
CONFIG_OPENTHREAD_SRP_CLIENT=y
CONFIG_OPENTHREAD_DNS_CLIENT=y
# CONFIG_OPENTHREAD_LOG_LEVEL_DYNAMIC is not set
CONFIG_OPENTHREAD_LOG_LEVEL_NOTE=y
# CONFIG_OPENTHREAD_CLI is not set

# Disable lwip ipv6 autoconfig
# CONFIG_LWIP_IPV6_AUTOCONFIG is not set

# Use a custom partition table
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# LwIP config for OpenThread
CONFIG_LWIP_IPV6_NUM_ADDRESSES=8
CONFIG_LWIP_MULTICAST_PING=y

# MDNS platform
# CONFIG_USE_MINIMAL_MDNS is not set
CONFIG_ENABLE_EXTENDED_DISCOVERY=y

# Enable OTA Requester
# CONFIG_ENABLE_OTA_REQUESTOR is not set

# Disable STA and AP for ESP32C6
# CONFIG_ESP_WIFI_ENABLED is not set
# CONFIG_ENABLE_WIFI_STATION is not set
# CONFIG_ENABLE_WIFI_AP is not set

# Enable chip shell
# CONFIG_ENABLE_CHIP_SHELL is not set

# Disable persist subscriptions
# CONFIG_ENABLE_PERSIST_SUBSCRIPTIONS is not set

# MRP configs
CONFIG_MRP_LOCAL_ACTIVE_RETRY_INTERVAL_FOR_THREAD=5000
CONFIG_MRP_LOCAL_IDLE_RETRY_INTERVAL_FOR_THREAD=5000
CONFIG_MRP_RETRY_INTERVAL_SENDER_BOOST_FOR_THREAD=5000
CONFIG_MRP_MAX_RETRANS=3

# Enable HKDF in mbedtls
CONFIG_MBEDTLS_HKDF_C=y
